validation/sphere/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

D           1.0;
ptsPerD     50;

nDvert      5.0;
nDup        5.0;
nDdown      25.0;

xCenter     0.0;
xMin        #calc "$xCenter-$D*$nDup";
xMax        #calc "$xCenter+$D*$nDdown";
nXup        #calc "$nDup*$ptsPerD";
nXdown      #calc "$nDdown*$ptsPerD";
nX          #calc "$nXup+$nXdown";

yCenter     0.0;
yMin        #calc "$yCenter-$D*$nDvert";
yMax        #calc "$yCenter+$D*$nDvert";
nY          #calc "$nDvert*$ptsPerD";

zCenter     0.0;
zMin        #calc "$zCenter-$D*$nDvert";
zMax        #calc "$zCenter+$D*$nDvert";
nz          1;//#calc "2*$nDvert*$ptsPerD";

xUpRatio1   1.0;
xUpRatio2   #calc "1/$xUpRatio1";

xDownRatio1 1.0;
xDownRatio2 #calc "1/$xDownRatio1";

yRatio1     1.0;
yRatio2     #calc "1/$yRatio1";


vertices
(
    ($xMin      $yMin       $zMin)
    ($xCenter   $yMin       $zMin)
    ($xMax      $yMin       $zMin)
    ($xMax      $yCenter    $zMin)
    ($xMax      $yMax       $zMin)
    ($xCenter   $yMax       $zMin)
    ($xMin      $yMax       $zMin)
    ($xMin      $yCenter    $zMin)
    ($xCenter   $yCenter    $zMin)

    ($xMin      $yMin       $zMax)
    ($xCenter   $yMin       $zMax)
    ($xMax      $yMin       $zMax)
    ($xMax      $yCenter    $zMax)
    ($xMax      $yMax       $zMax)
    ($xCenter   $yMax       $zMax)
    ($xMin      $yMax       $zMax)
    ($xMin      $yCenter    $zMax)
    ($xCenter   $yCenter    $zMax)
);

blocks
(
//     hex (0 2 4 6 9 11 13 15) ($nX $nY 1) simpleGrading (1 1 1)

    hex (0 1 8 7 9 10 17 16) ($nXup $nY $nz)
        simpleGrading ($xUpRatio2 $yRatio2 $nz)

    hex (1 2 3 8 10 11 12 17) ($nXdown $nY $nz)
        simpleGrading ($xDownRatio1 $yRatio2 $nz)

    hex (8 3 4 5 17 12 13 14) ($nXdown $nY $nz)
        simpleGrading ($xDownRatio1 $yRatio1 $nz)

    hex (7 8 5 6 16 17 14 15) ($nXup $nY $nz)
        simpleGrading ($xUpRatio2 $yRatio1 $nz)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (7 0 9 16)
            (6 7 16 15)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 3 12 11)
            (3 4 13 12)
        );
    }
    freestream1
    {
        type patch;
        neighbourPatch freestream2;
        faces
        (
            (6 5 14 15)
            (4 5 14 13)
        );
    }
    freestream2
    {
        type patch;
        neighbourPatch freestream1;
        faces
        (
            (0 1 10 9)
            (1 2 11 10)
        );
    }
    freestream3
    {
        type empty;
        neighbourPatch freestream4;
        faces
        (
            (0 1 8 7)
            (1 2 3 8)
            (7 8 5 6)
            (8 3 4 5)
        );
    }
    freestream4
    {
        type empty;
        neighbourPatch freestream3;
        faces
        (
            (10 9 16 17)
            (11 10 17 12)
            (17 16 15 14)
            (12 17 14 13)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
