validation/sphere/constant/initialStates
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      initialStates;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nParticles	1;
flow
{
UInf	(0.3 0 0);
rho	rhoInf;
rhoInf	1.4;
}
particle.0
{
particleShape	cylinder;
p1	(0 0 -0.5);
p2	(0 0 0.5);
d	0.1;
nTheta	160;
delta	0.003;
}

